-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:8889
-- Время создания: Май 26 2022 г., 12:39
-- Версия сервера: 5.7.34
-- Версия PHP: 7.4.21

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `project`
--
CREATE DATABASE IF NOT EXISTS `project` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `project`;

-- --------------------------------------------------------

--
-- Структура таблицы `notes`
--

CREATE TABLE `notes` (
  `id` int(11) NOT NULL,
  `title` varchar(30) DEFAULT NULL,
  `article` varchar(255) DEFAULT NULL,
  `created` date NOT NULL,
  `deleted` tinyint(1) NOT NULL DEFAULT '0',
  `user_id` int(11) NOT NULL,
  `color` varchar(30) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=cp1251;

--
-- Дамп данных таблицы `notes`
--

INSERT INTO `notes` (`id`, `title`, `article`, `created`, `deleted`, `user_id`, `color`) VALUES
(4, 'РџРёР·Рґ', 'РЇ РІ СЃРІРѕРµРј РїРѕР·РЅР°РЅРёРё РЅР°СЃС‚РѕР»СЊРєРѕ РїСЂРµРёСЃРїРѕР»РЅРёР»СЃСЏ, С‡С‚Рѕ СЏ РєР°Рє Р±СѓРґС‚Рѕ Р±С‹ СѓР¶Рµ СЃС‚Рѕ С‚СЂРёР»Р»РёРѕРЅРѕРІ РјРёР»Р»РёР°СЂРґРѕРІ Р»РµС‚ РїСЂРѕР¶РёРІР°СЋ РЅР° С‚СЂРёР»Р»РёРѕРЅР°С… Рё С‚СЂРёР»Р»РёРѕРЅР°С… С‚Р°РєРёС… ', '1917-02-27', 0, 1, 'FFB6C1'),
(5, 'РџРёР·РґР°С‚Р°СЏ Р·Р°РјРµС‚РєР', 'РїРѕРЅСЏС‚РµРЅ, Рё СЏ Р·РґРµСЃСЊ РёС‰Сѓ С‚РѕР»СЊРєРѕ РѕРґРЅРѕРіРѕ - РїРѕРєРѕСЏ, СѓРјРёСЂРѕС‚РІРѕСЂРµРЅРёСЏ Рё РІРѕС‚ СЌС‚РѕР№ РіР°СЂРјРѕРЅРёРё, РѕС‚ СЃР»РёСЏРЅРёСЏ СЃ Р±РµСЃРєРѕРЅРµС‡РЅРѕ РІРµС‡РЅС‹Рј, РѕС‚ СЃРѕР·РµСЂС†Р°РЅРёСЏ РІРµР»РёРєРѕРіРѕ С„СЂР°РєС‚', '1917-02-27', 0, 1, 'FF7F50'),
(6, 'РџРёР·РґР°С‚Р°СЏ Р·Р°РјРµС‚РєР', 'СЃСѓС‰РµСЃС‚РІР°, Р±РµСЃРєРѕРЅРµС‡РЅРѕ РІРµС‡РЅРѕРіРѕ, РєСѓРґР° РЅРё РїРѕСЃРјРѕС‚СЂРё, С…РѕС‚СЊ РІРіР»СѓР±СЊ - Р±РµСЃРєРѕРЅРµС‡РЅРѕ РјР°Р»РѕРµ, С…РѕС‚СЊ РІРІС‹СЃСЊ - Р±РµСЃРєРѕРЅРµС‡РЅРѕРµ Р±РѕР»СЊС€РѕРµ, РїРѕРЅРёРјР°РµС€СЊ? Рђ С‚С‹ РјРЅРµ РѕРїСЏС‚СЊ СЃРѕ', '1917-02-27', 0, 1, 'FFFACD'),
(7, 'РџРёР·РґР°С‚Р°СЏ Р·Р°РјРµС‚РєР', 'С‚РІРѕР№ РїСѓС‚СЊ Рё С‚РІРѕР№ РіРѕСЂРёР·РѕРЅС‚ РїРѕР·РЅР°РЅРёСЏ Рё РѕС‰СѓС‰РµРЅРёСЏ С‚РІРѕРµР№ РїСЂРёСЂРѕРґС‹, РѕРЅ РЅРµСЃРѕРёР·РјРµСЂРёРјРѕ РјРµР»РѕРє РїРѕ СЃСЂР°РІРЅРµРЅРёСЋ СЃ РјРѕРёРј, РїРѕРЅРёРјР°РµС€СЊ? РЇ РєР°Рє Р±СѓРґС‚Рѕ Р±С‹ СѓР¶Рµ РґР°РІРЅРѕ Рі', '1917-02-27', 0, 1, 'FA8072'),
(8, 'РџРёР·РґР°С‚Р°СЏ Р·Р°РјРµС‚РєР', 'РєРѕС‚РѕСЂС‹Р№ РЅР° СЌС‚РѕР№ РїР»Р°РЅРµС‚Рµ РѕС‚ РµС‘ СЃР°РјРѕРіРѕ Р·Р°СЂРѕР¶РґРµРЅРёСЏ, РµС‰С‘ РєРѕРіРґР° С‚РѕР»СЊРєРѕ РЎРѕР»РЅС†Рµ С‚РѕР»СЊРєРѕ-С‚РѕР»СЊРєРѕ СЃС„РѕСЂРјРёСЂРѕРІР°Р»РѕСЃСЊ РєР°Рє Р·РІРµР·РґР°, Рё РІРѕС‚ СЌС‚Рѕ РіР°Р·РѕРїС‹Р»РµРІРѕРµ РѕР±Р»', '1917-02-27', 0, 1, 'DDA0DD'),
(9, 'РџРёР·РґР°С‚Р°СЏ Р·Р°РјРµС‚РєР', 'С„РѕСЂРјРёСЂРѕРІР°С‚СЊ РІРѕС‚ СЌС‚Рё РєРѕР°С†РµСЂРІР°С‚С‹, РїР»Р°РЅРµС‚С‹, РїРѕРЅРёРјР°РµС€СЊ, СЏ РЅР° СЌС‚РѕР№ Р—РµРјР»Рµ СѓР¶Рµ РєР°Рє Р±СѓРґС‚Рѕ РїРѕС‡С‚Рё РїСЏС‚СЊ РјРёР»Р»РёР°СЂРґРѕРІ Р»РµС‚ Р¶РёРІСѓ Рё Р·РЅР°СЋ РµС‘ РІРґРѕР»СЊ Рё РїРѕРїРµСЂС‘Рє СЌС‚', '1917-02-27', 0, 1, '7FFFD4'),
(10, 'РџРёР·РґР°С‚Р°СЏ Р·Р°РјРµС‚РєР', 'РјРЅРµ РЅРµ РІР°Р¶РЅРѕ РЅР° С‚РІРѕРё С‚Р°С‡РєРё, РЅР° С‚РІРѕРё СЏС…С‚С‹, РЅР° С‚РІРѕРё РєРІР°СЂС‚РёСЂС‹, С‚Р°Рј, РЅР° С‚РІРѕС‘ Р±Р»Р°РіРѕ. РЇ Р±С‹Р» РЅР° СЌС‚РѕР№ РїР»Р°РЅРµС‚Рµ Р±РµСЃРєРѕРЅРµС‡РЅС‹Рј РјРЅРѕР¶РµСЃС‚РІРѕРј, Рё РєСЂСѓС‡Рµ Р¦РµР·Р°СЂСЏ, Рё Р', '1917-02-27', 0, 1, '87CEEB'),
(11, 'РџРёР·РґР°С‚Р°СЏ Р·Р°РјРµС‚РєР', 'РІСЃРµС… РІРµР»РёРєРёС…, РїРѕРЅРёРјР°РµС€СЊ, Р±С‹Р», Р° РіРґРµ-С‚Рѕ Р±С‹Р» РєРѕРЅС‡РµРЅС‹Рј РіРѕРІРЅРѕРј, РµС‰С‘ С…СѓР¶Рµ, С‡РµРј Р·РґРµСЃСЊ. РЇ РјРЅРѕР¶РµСЃС‚РІРѕ СЌС‚РёС… СЃРѕСЃС‚РѕСЏРЅРёР№ С‡СѓРІСЃС‚РІСѓСЋ. Р“РґРµ-С‚Рѕ СЏ Р±С‹Р» Р±РѕР»СЊС€Рµ РїРѕРґРѕР±', '1917-02-27', 0, 1, '00FA9A'),
(12, 'РџРёР·РґР°С‚Р°СЏ Р·Р°РјРµС‚РєР', 'Р±С‹Р» РїСЂРѕСЃС‚Рѕ СЃРіСѓСЃС‚РѕРє РєР°РјРЅСЏ, СЌС‚Рѕ РІСЃС‘ РµСЃС‚СЊ РґСѓС€Р°, РїРѕРЅРёРјР°РµС€СЊ? РћРЅР° РёРјРµРµС‚ РіСЂР°РЅРё РїРѕРґРѕР±РёСЏ СЃРѕРІРµСЂС€РµРЅРЅРѕ РјРЅРѕРіРѕРѕР±СЂР°Р·РЅС‹Рµ, Р±РµСЃРєРѕРЅРµС‡РЅРѕРµ РјРЅРѕР¶РµСЃС‚РІРѕ. РќРѕ С‚РµР±Рµ СЌС‚Р', '1917-02-27', 0, 1, '98FB98'),
(14, 'РџРёР·РґР°С‚Р°СЏ Р·Р°РјРµС‚РєР', 'СЂР°Р·РЅС‹РјРё РѕС‰СѓС‰РµРЅРёСЏРјРё Рё СЂР°Р·РЅС‹РјРё СЃС‚СЂРµРјР»РµРЅРёСЏРјРё, СЃРѕРѕС‚РІРµС‚СЃС‚РІРµРЅРЅРѕ, СЂР°Р·РЅРѕРµ РЅР°С€Рµ Рё РјРµСЃС‚Рѕ, СЂР°Р·РЅРѕРµ Рё РЅР°С€Рµ СЂР°СЃРїСЂРµРґРµР»РµРЅРёРµ. РўРµР±Рµ СЏ Р¶РµР»Р°СЋ РІСЃРµ СЃР°РјС‹Рµ РєСЂСѓС‚С‹Рµ С', '1917-02-27', 0, 1, NULL),
(15, 'РџРёР·РґР°С‚Р°СЏ Р·Р°РјРµС‚РєР', 'С‚РІРѕСЋ РёРґРµСЋ РїСЂРµРґР»РѕР¶Сѓ СЃРѕС‚РЅСЋ С‚СЂРёР»Р»РёРѕРЅРѕРІ, РєР°Рє РІСЃС‘ РґРµР»Р°С‚СЊ. РќСѓ Р° СЏ РІСЃС‘, СЏ РёРґСѓ РєР°Рє РіР»СѓР±РѕРєРёР№ СЃС‚Р°СЂРµС†,СѓР·СЂРµРІС€РёР№ РІРµС‡РЅРѕРµ, РїСЂРёРєРѕСЃРЅСѓРІС€РёР№СЃСЏ Рє Р‘РѕР¶РµСЃС‚РІРµРЅРЅРѕРјСѓ, СЃ', '1917-02-27', 0, 1, NULL),
(16, 'РџРёР·РґР°С‚Р°СЏ Р·Р°РјРµС‚РєР', 'Р±Р»Р°Р¶РµРЅСЃС‚РІРµ РїСЂРµР±С‹РІР°РµС‚, РІРѕРІР»РµС‡РµРЅРЅС‹Р№ РІРѕ РІСЃС‘ Рё РІРѕ РІСЃСЏ, РїРѕРЅРёРјР°РµС€СЊ, РІРѕС‚ Рё РІСЃС‘, РІ СЌС‚РѕРј РЅР°С€Р° СЂР°Р·РЅРёС†Р°. РўР°Рє С‡С‚Рѕ СЏ РёРґСѓ Р»СЋР±РѕРІР°С‚СЊСЃСЏ РјРёСЂРѕР·РґР°РЅРёРµРј, Р° С‚С‹ РёРґС‘С€СЊ ', '1917-02-27', 0, 1, NULL),
(17, 'РџРёР·РґР°С‚Р°СЏ Р·Р°РјРµС‚РєР', 'СЃРєР°Р·Р°С‚СЊ, Р±РѕР»РµРµ Р°РєС‚РёРІРµРЅ, РєР°Рє РІРѕС‚ СЌС‚РѕС‚ РґСЏС‚РµР» РґРѕР»Р±СЏС‰РёР№, РёР»Рё РјСѓСЂР°РІРµР№, РєРѕС‚РѕСЂС‹Р№ РѕС‡РµРЅСЊ Р°РєС‚РёРІРµРЅ РІ СЃРІРѕРµР№ СЃС‚РµР·Рµ, РїРѕСЌС‚РѕРјСѓ РґР°РІР°Р№, РЅР°С€Рё РїСѓС‚Рё Р·РґРµСЃСЊ, РєРѕРЅРµС‡РЅР', '1917-02-27', 0, 1, NULL),
(18, 'РџРёР·РґР°С‚Р°СЏ Р·Р°РјРµС‚РєР', 'СЃРѕРґРµСЂР¶Сѓ, РІСЃСЋ С‚РІРѕСЋ РїСЂРёСЂРѕРґСѓ, РѕРЅР° СЃРѕСЃС‚Р°РІР»СЏРµС‚ РѕРґРЅСѓ РјР°Р»РµРЅСЊРєСѓСЋ С‚Р°Рј РїРµСЃС‡РёРЅРѕС‡РєСѓ, РѕС‚ С‚РѕРіРѕ С‡С‚Рѕ РµСЃС‚СЊ РІРѕ РјРЅРµ, РІРѕС‚ Рё РІСЃС‘, РїРѕСЌС‚РѕРјСѓ РґР°РІР°Р№, СЃС‚СѓРїР°Р№, РµР·Р¶Р°Р№, Р° СЏ Рї', '1917-02-27', 0, 1, NULL);

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `login` varchar(40) NOT NULL,
  `password` varchar(40) NOT NULL,
  `privileges` varchar(1) NOT NULL,
  `username` varchar(40) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=cp1251;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `login`, `password`, `privileges`, `username`) VALUES
(1, 'Shulga_M_V@huya.tv', 'ne_nado_dada_strong_password', '1', NULL),
(2, 'New_user@huya.tv', 'New_user_ahueni_parol', 'u', '');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `notes`
--
ALTER TABLE `notes`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `notes`
--
ALTER TABLE `notes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
